CSI API ETABS v1
cDesignConcrete.GetSummaryResultsColumn Method
 Retrieves column summary results for concrete design
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSummaryResultsColumn(
	string Name,
	ref int NumberItems,
	ref string[] FrameName,
	ref int[] MyOption,
	ref double[] Location,
	ref string[] PMMCombo,
	ref double[] PMMArea,
	ref double[] PMMRatio,
	ref string[] VMajorCombo,
	ref double[] AVMajor,
	ref string[] VMinorCombo,
	ref double[] AVMinor,
	ref string[] ErrorSummary,
	ref string[] WarningSummary,
	eItemType ItemType = eItemType.Objects
)
Function GetSummaryResultsColumn (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef FrameName As String(),
	ByRef MyOption As Integer(),
	ByRef Location As Double(),
	ByRef PMMCombo As String(),
	ByRef PMMArea As Double(),
	ByRef PMMRatio As Double(),
	ByRef VMajorCombo As String(),
	ByRef AVMajor As Double(),
	ByRef VMinorCombo As String(),
	ByRef AVMinor As Double(),
	ByRef ErrorSummary As String(),
	ByRef WarningSummary As String(),
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cDesignConcrete
Dim Name As String
Dim NumberItems As Integer
Dim FrameName As String()
Dim MyOption As Integer()
Dim Location As Double()
Dim PMMCombo As String()
Dim PMMArea As Double()
Dim PMMRatio As Double()
Dim VMajorCombo As String()
Dim AVMajor As Double()
Dim VMinorCombo As String()
Dim AVMinor As Double()
Dim ErrorSummary As String()
Dim WarningSummary As String()
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.GetSummaryResultsColumn(Name,
	NumberItems, FrameName, MyOption,
	Location, PMMCombo, PMMArea, PMMRatio,
	VMajorCombo, AVMajor, VMinorCombo,
	AVMinor, ErrorSummary, WarningSummary,
	ItemType)
int GetSummaryResultsColumn(
	String^ Name,
	int% NumberItems,
	array<String^>^% FrameName,
	array<int>^% MyOption,
	array<double>^% Location,
	array<String^>^% PMMCombo,
	array<double>^% PMMArea,
	array<double>^% PMMRatio,
	array<String^>^% VMajorCombo,
	array<double>^% AVMajor,
	array<String^>^% VMinorCombo,
	array<double>^% AVMinor,
	array<String^>^% ErrorSummary,
	array<String^>^% WarningSummary,
	eItemType ItemType = eItemType::Objects
)
abstract GetSummaryResultsColumn :
        Name : string *
        NumberItems : int byref *
        FrameName : string[] byref *
        MyOption : int[] byref *
        Location : float[] byref *
        PMMCombo : string[] byref *
        PMMArea : float[] byref *
        PMMRatio : float[] byref *
        VMajorCombo : string[] byref *
        AVMajor : float[] byref *
        VMinorCombo : string[] byref *
        AVMinor : float[] byref *
        ErrorSummary : string[] byref *
        WarningSummary : string[] byref *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing frame object or group, depending on the value of the ItemType item.
NumberItems
Type: System.Int32
 The number of frame objects for which results are obtained.
FrameName
Type: System.String[]
 This is an array that includes each frame object name for which results are obtained.
MyOption
Type: System.Int32[]
 This is an array that includes 1 or 2, indicating the design option for each frame object
Check
Design
Location
Type: System.Double[]
 This is an array that includes the distance from the I-end of the frame object to the location where the results are reported. [L]
PMMCombo
Type: System.String[]
 This is an array that includes the name of the design combination for which the controlling PMM ratio or rebar area occurs. A combination name followed by (Sp) indicates that the design loads were obtained by applying special, code-specific multipliers to all or part of the specified design load combination, or that the design was based on the capacity of other objects (or other design locations for the same object).
PMMArea
Type: System.Double[]
 This is an array that includes the total longitudinal rebar area required for the axial force plus biaxial moment (PMM) design at the specified location. [L2]
 This item applies only when MyOption = 2 (design).
PMMRatio
Type: System.Double[]
 This is an array that includes the axial force plus biaxial moment (PMM) stress ratio at the specified location
 This item applies only when MyOption = 1 (check).
VMajorCombo
Type: System.String[]
 This is an array that includes the name of the design combination for which the controlling major shear occurs.
AVMajor
Type: System.Double[]
 This is an array that includes the required area of transverse shear reinforcing per unit length along the frame object for major shear at the specified location. [L2/L]
VMinorCombo
Type: System.String[]
 This is an array that includes the name of the design combination for which the controlling minor shear occurs.
AVMinor
Type: System.Double[]
 This is an array that includes the required area of transverse shear reinforcing per unit length along the frame object for minor shear at the specified location. [L2/L]
ErrorSummary
Type: System.String[]
 This is an array that includes the design error messages for the frame object, if any.
WarningSummary
Type: System.String[]
 This is an array that includes the design warning messages for the frame object, if any.
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the design results are retrieved for the frame object specified by the Name item.
 If this item is Group, the design results are retrieved for all frame objects in the group specified by the Name item.
 If this item is SelectedObjects, the design results are retrieved for all selected frame objects, and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the results are successfully retrieved; otherwise it returns a nonzero value
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Name As String
   Dim NumberItems As Integer
   Dim FrameName() As String
   Dim MyOption() As Integer
   Dim Location() As Double
   Dim PMMCombo() As String
   Dim PMMArea() As Double
   Dim PMMRatio() As Double
   Dim VmajorCombo() As String
   Dim AVmajor() As Double
   Dim VminorCombo() As String
   Dim AVminor() As Double
   Dim ErrorSummary() As String
   Dim WarningSummary() As String
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'add ASTM A706 rebar material
   ret = SapModel.PropMaterial.AddMaterial(Name, eMatType.Rebar, "United States", "ASTM A706", "Grade 60")
'create new concrete frame section properties
   ret = SapModel.PropFrame.SetRectangle("COL", "4000Psi", 20, 20)
   ret = SapModel.PropFrame.SetRectangle("BEAM", "4000Psi", 20, 12)
   ret = SapModel.PropFrame.SetRebarBeam("BEAM", Name, Name, 2, 2, 2, 2, 2, 2)
'assign concrete column
    ret = SapModel.FrameObj.SetSection("4", "COL")
'run analysis
   System.IO.Directory.CreateDirectory("c:\CSI_API_temp")
   ret = SapModel.File.Save("C:\CSI_API_temp\example.edb")
   ret = SapModel.Analyze.RunAnalysis()
'start concrete design
   ret = SapModel.DesignConcrete.StartDesign()
'get summary result data
   ret = SapModel.DesignConcrete.GetSummaryResultsColumn("4", NumberItems, FrameName, MyOption, Location, PMMCombo, PMMArea, PMMRatio, VmajorCombo, AVmajor, VminorCombo, AVminor, ErrorSummary, WarningSummary)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDesignConcrete Interface
ETABSv1 Namespace